:PROPERTIES:
:ID:       e7306f88-f756-4210-87c5-e53bc24315bb
:END:
#+title: ENG306 - Power Electronics - Project
#+date: [2025-09-16 Tue 10:17]
#+AUTHOR: Baley Eccles - 652137
#+STARTUP: latexpreview

* ENG306 - Power Electronics - Project

** Stage 1 - Full-Wave Rectifier
 - Input of 32V (rms) gives 43.43V
 - Input of 20V (rms) gives 26.46V

   R= 43/5

** Stage 2 - Synchronous Buck Controller
\[L = \frac{V_{in} - V_O}{\Delta I_L f_{SW}}D_{ON}\]
\[47\mu = \frac{43.43 - 12}{0.1\times 100k}D\]
\[D = \frac{47\mu\times0.1\times 100k}{5 - 0.5}\]

Max Load = 12/5 = 2.4
Min Load = 12/0.5 = 24


Kp = 0.01 and Ki = 10
** Week 10 Workshop Stuff
Added
 - inductor L1 = 47uH
 - three 3.3uF caps (C10, C11, C14)
 - two 22uF caps (C16, C17)
Recorded with any DC input voltage
 - Output gives 10.5V

Datasheet: https://www.ti.com/lit/ds/symlink/lm5117.pdf, might be good for inductor calculations

** Design
From Datasheet: https://www.ti.com/lit/ds/symlink/lm5117.pdf
\[R_{b8} || 22k = \frac{5.2\times10^9}{f_{SW}} - 948\]
if $R_{b8} = 0$ then $f_{SW} = 226\ 600\ Hz$
\[L = 47\mu = \frac{V_{out}}{I_{\max}f_{SW}}\left(1 - \frac{V_{out}}{V_{in,\max}}\right)\]
\[L = 47\mu = \frac{12}{5\times f_{SW}}\left(1 - \frac{12}{V_{in,\max}}\right)\]

\[I_{\max} = \frac{V_{out}}{L f_{SW}}\left(1 - \frac{V_{out}}{V_{in}}\right)\]
\[I_{\max} = \frac{12}{47\mu f_{SW}}\left(1 - \frac{12}{20}\right)\]


\[V_{in,\max} = \frac{\Delta V_{rectifier,out}}{2} + V_{rectifier,out}\]
\[V_{in,\max} = \frac{\Delta V_{rectifier,out}}{2} + 20\]

-------------------------------------
$V_{out} = 12$
$I_{out} = 5$
$V_{in,\min} = 20$
$V_{in,\max} = 32$
$f_{SW} = 230\ kHz$

\[R_{T} = \frac{5.2\times 10^9}{230\times^10^3} - 948 = 21.7k \approx 22k\]
\[L = \frac{V_{out}}{I_{\max}f_{SW}}\left(1 - \frac{V_{out}}{V_{in,\max}}\right)\]
\[L = \frac{12}{9\cdot230\times10^3}\left(1 - \frac{12}{32}\right) = 6.522\mu\]

\[I_{\max} = \frac{V_{out}}{L\cdot f_{SW}}\left(1 - \frac{V_{out}}{V_{in,\max}}\right)\]
\[5 = \frac{12}{L\times 10^{-6}\cdot 230\times10^3}\left(1 - \frac{12}{32}\right)\]
\[\Rightarrow L < 16\]


#+BEGIN_SRC octave :exports none :results output :session Q1
clc
clear
close all

if exist('OCTAVE_VERSION', 'builtin')
  set(0, "DefaultLineLineWidth", 2);
  set(0, "DefaultAxesFontSize", 25);
  warning('off');
  pkg load symbolic
end

syms R_freq I_pp I_avg f_sw Delta_V_in C_in V_in real

% Known Varibles
L = 47e-6;
R_T = 22e3;
V_out = 12;


I_max = 5;
I_min = 0.5;
Delta_V_out = 0.007*V_out;

R_ESR = 300e-3; % This can be found in the data sheet for C_out. I dont know which datasheet to look at, I have assumed worst case
C_15 = 470e-6;
C_16 = 22e-6;
C_17 = 22e-6;
C_out = C_15 + C_16 + C_17;


% Equations
equ1 = 1/(1/R_T + 1/R_freq) == 5.2e9/f_sw - 948;
equ1 = simplify(equ1);

equ2 = I_max == V_out/(L*f_sw)*(1 - V_out/V_in);
equ2 = simplify(equ2);

equ3 = I_pp == V_out/(L*f_sw)*(1 - V_out/V_in);
equ3 = simplify(equ3);

equ4 = I_max == I_avg + I_pp/2;
equ4 = simplify(equ4);

equ5 = Delta_V_out == I_pp*sqrt(R_ESR^2 + (1/(8*f_sw*C_out))^2);
equ5 = simplify(equ5);

equ6 = Delta_V_in == I_max/(4*f_sw*C_in);
equ6 = simplify(equ6);

equ1
equ2
equ3
equ4
equ5
equ6

solutions = solve([equ1, equ2, equ3, equ4, equ5, equ6], [R_freq, I_pp, I_avg, f_sw, Delta_V_in, C_in, V_in])

% Display the results
%sol = solutions(1){1}
sol = solutions;
double(abs(sol.C_in))
double(abs(sol.I_avg))
double(abs(sol.I_pp))
double(abs(sol.R_freq))
double(abs(sol.f_sw))

#+END_SRC

#+RESULTS:
#+begin_example
equ1 = (sym)

        5200000000         
  948 - ────────── = -22000
           f_sw
equ2 = (sym)

  1276596⋅(Vᵢₙ - 12)    
  ────────────────── = 5
      5⋅Vᵢₙ⋅f_sw
equ3 = (sym)

        1276596⋅(Vᵢₙ - 12)
  Iₚₚ = ──────────────────
            5⋅Vᵢₙ⋅f_sw
equ4 = (sym) 2⋅I_avg + Iₚₚ = 10
equ5 = (sym)

         _______________________________      
        ╱        2     2                      
  Iₚₚ⋅╲╱  63504⋅π ⋅f_sw  + 411862315225    21 
  ────────────────────────────────────── = ───
               840⋅π⋅│f_sw│                250
equ6 = (sym)

               5     
  Δ_V_in = ──────────
           4⋅Cᵢₙ⋅f_sw
solutions = {}(0x0)
error: cell cannot be indexed with .
error: cell cannot be indexed with .
error: cell cannot be indexed with .
error: cell cannot be indexed with .
error: cell cannot be indexed with .
#+end_example

** Rectifier Output Filter
Do as many LC stages with $470\mu F$ caps and $47\mu H$ inductors as possible.

** Fix 12V output
Change R18, R17, R16 and  Rb16.
 - See 8.3.21 in datasheet for calculations
\[\frac{R_{FB2}}{R_{FB1}} = \frac{V_{out}}{0.8} - 1\]
\[\frac{R_{FB2}}{R_{FB1}} = \frac{12}{0.8} - 1 = 14\]

In our circuit
\[R_{FB2} = 22 + 4700 = 4722\]
\[R_{FB1} = 470 || 2200 = 387.27\]

\[\frac{R_{FB2}}{R_{FB1}} = \frac{4722}{387.27} = 12.183\]
Solving $12.183 = \frac{V_{out}}{0.8} - 1$ we get $V_{out} = 10.554$, which is what we were seeing on the output.

We should remove R16 and replace it with the following
\[\frac{4722}{R_{FB1}} = \frac{12}{0.8} - 1\]
\[R_{FB1} = \frac{4722}{\frac{12}{0.8} - 1} = 337.285\]

\[R_{FB1} = R16 || 2200 = 337.285\]
\[337.285 = 1/(1/R16 + 1/2200)\]
\[\Rightarrow R16 = 398.358 769\Omega \]

\[R16 \approx 400\Omega\]
If we choose this, then:
\[\frac{R_{FB2}}{R_{FB1}} = \frac{4722}{400 || 2200} = \frac{V_{out}}{0.8} - 1\]
\[\Rightarrow V_{out} = 11.961\]

This may be good enough, but if it isn't we can remove Rb16 too and choose:

#+BEGIN_SRC octave :exports none :results output :session Feedback
clc;
clear;
close all;

R_18 = 22.4;
R_17 = 4.345e3;
R_FB1 = 338.7;

V_out = 12;

R_FB2 = R_17 + R_18;

R_FB1 = R_FB2/(V_out/0.8 - 1);

% Add actual avalible resistors to R_vals
R_vals = [0, 1e3, 10e3, 1, 1.2, 1.5, 2, 2.7, 3.3, 4.3, 5.1, 6.8, 8.2, 10, 12, 15, 20, 27, 33, 43, 51, 68, 82, 100, 120, 150, 200, 270, 330, 430, 510, 680, 820, 1.2e3, 1.5e3, 2e3, 2.7e3, 3.3e3, 4.3e3, 5.1e3, 6.8e3, 8.2e3, 12e3, 15e3, 20e3, 27e3, 33e3, 43e3, 51e3, 68e3, 82e3, 100e3, 120e3, 150e3, 200e3, 270e3, 330e3, 430e3, 510e3, 680e3, 820e3, 1e6, 2e6];

R16 = R_vals;

Rb16 = 1./(1./R_FB1 - 1./R16);

% May need to change tolerance
tol = 5/100; % Tolerance of 5%

for idx = 1:length(R16)
  for jdx = 1:length(R_vals)
    up_bound = R_vals(jdx) + R_vals(jdx)*tol;
    low_bound = R_vals(jdx) - R_vals(jdx)*tol;
    if (Rb16(idx) >= low_bound && Rb16(idx) <= up_bound)
      percent_error = 100*abs(R_vals(jdx) - Rb16(idx))/Rb16(idx);
      V_out_true = 0.8*(R_FB2/(1/(1/R16(idx) + 1/R_vals(jdx))) + 1);
      
      sprintf("For a resistor error of %f%% choose:", percent_error)
      sprintf("R16 = %f and ideally Rb16 = %f, but select Rb16 = %f from the resistor book. This will give an output voltage of %f", R16(idx), Rb16(idx), R_vals(jdx), V_out_true)
      
    end
  end
end

#+END_SRC

#+RESULTS:
#+begin_example
ans = For a resistor error of NaN% choose:
ans = R16 = 0.000000 and ideally Rb16 = -0.000000, but select Rb16 = 0.000000 from the resistor book. This will give an output voltage of Inf
ans = For a resistor error of 2.483762% choose:
ans = R16 = 10000.000000 and ideally Rb16 = 322.002233, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.737028
ans = For a resistor error of 2.072306% choose:
ans = R16 = 510.000000 and ideally Rb16 = 803.352088, but select Rb16 = 820.000000 from the resistor book. This will give an output voltage of 11.911702
ans = For a resistor error of 1.288873% choose:
ans = R16 = 820.000000 and ideally Rb16 = 503.510390, but select Rb16 = 510.000000 from the resistor book. This will give an output voltage of 11.911702
ans = For a resistor error of 2.006113% choose:
ans = R16 = 1200.000000 and ideally Rb16 = 421.543362, but select Rb16 = 430.000000 from the resistor book. This will give an output voltage of 11.836995
ans = For a resistor error of 4.216238% choose:
ans = R16 = 3300.000000 and ideally Rb16 = 344.526040, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 12.446400
ans = For a resistor error of 1.890657% choose:
ans = R16 = 4300.000000 and ideally Rb16 = 336.359403, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 12.200176
ans = For a resistor error of 0.686827% choose:
ans = R16 = 5100.000000 and ideally Rb16 = 332.282203, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 12.072719
ans = For a resistor error of 0.930820% choose:
ans = R16 = 6800.000000 and ideally Rb16 = 326.956621, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.901448
ans = For a resistor error of 1.759371% choose:
ans = R16 = 8200.000000 and ideally Rb16 = 324.294457, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.813724
ans = For a resistor error of 3.033762% choose:
ans = R16 = 12000.000000 and ideally Rb16 = 320.283367, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.678796
ans = For a resistor error of 3.583762% choose:
ans = R16 = 15000.000000 and ideally Rb16 = 318.582754, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.620564
ans = For a resistor error of 4.133762% choose:
ans = R16 = 20000.000000 and ideally Rb16 = 316.900105, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.562332
ans = For a resistor error of 4.561539% choose:
ans = R16 = 27000.000000 and ideally Rb16 = 315.603617, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.517041
ans = For a resistor error of 4.783762% choose:
ans = R16 = 33000.000000 and ideally Rb16 = 314.934294, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.493513
ans = For a resistor error of 5.016320% choose:
ans = R16 = 43000.000000 and ideally Rb16 = 314.236874, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.468890
ans = For a resistor error of 5.136703% choose:
ans = R16 = 51000.000000 and ideally Rb16 = 313.877068, but select Rb16 = 330.000000 from the resistor book. This will give an output voltage of 11.456145
#+end_example

We got 
* Testing
** Performance
Verify that the output voltage ripple remains within $0.084V$ of $12V$ with loads ranging from $24\Omega$ to $2.4\Omega$ and AC inputs from $20V$ to $32V$.
 - Lowest load is $24.7\Omega$

If it can do $V_{in,rms} = 20V$ and $R_{load} = 2.4\Omega$ while remaining within $0.084V$, then we will have succeeded.


Check if can charge a laptop.
 - The laptop takes 20V, but we still tried it.
   - It did not work
 - A Arduino Uno takes 12V
   - It did work
   - Pictures were taken


 Using $25\Omega$ and $2.2\Omega$
** Efficiency
For different input voltages measure the loss at maximum load.
 - We could not do max load because the resistors were getting too hot
   - So we are doing min load

\begin{align*}
P_{in} &= V_{in} I_{in} \\
P_{out} &= V_{out} I_{out} \\
\eta &= \frac{P_{out}}{P_{in}}
\end{align*}

|--------------+----------+----------+-----------+-----------+--------------+--------|
| $V_{in,rms}$ | $I_{in}$ | $P_{in}$ | $V_{out}$ | $I_{out}$ | $P_{output}$ | $\eta$ |
|--------------+----------+----------+-----------+-----------+--------------+--------|
|           32 | 362m     |          |    11.914 | 482m      |              |        |
|           29 | 396m     |          |    11.914 | 482m      |              |        |
|           26 | 435m     |          |    11.914 | 482m      |              |        |
|           23 | 496m     |          |    11.914 | 482m      |              |        |
|           20 | 548m     |          |    11.916 | 482m      |              |        |
|--------------+----------+----------+-----------+-----------+--------------+--------|

** Harmonics
At maximum load ($R_{load} = 2.4\Omega$) and minimum input ($V_{in,rms} = 20V$)
 - We did it at best operating point

Calculate THD, $I_{1,rms}$ is at $50Hz$ and $I_{rms}$ is all frequencies.
\begin{align*}
I_{rms} &= \\
I_{1,rms} &= \\
THD &= \sqrt{\left(\frac{I_{rms}}{I_{1,rms}}\right)^2 - 1} 
\end{align*}

** Light or No Loading
Have no-load and take scope shots of the output inductor and capacitors. Explain what is happening.

** Regulation Capability
Calculate line regulation ([[https://en.wikipedia.org/wiki/Line_regulation]])
\[\text{Line Regulation}\%=\frac{\Delta V_o}{\Delta V_i\cdot V_o}\cdot 100\]

Input changes in voltage to the input and measure the change in the output for various loads.

